SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/ZGM23/Include/zgm23_eca.h
/* Bit fields for ECA BUF_WMOFFSET */
#define _ECA_BUF_WMOFFSET_RESETVALUE                   0x00000000UL                            /**< Default value for ECA_BUF_WMOFFSET          */
#define _ECA_BUF_WMOFFSET_MASK                         0x0007FFFCUL                            /**< Mask for ECA_BUF_WMOFFSET                   */
#define _ECA_BUF_WMOFFSET_OFFSET_SHIFT                 2                                       /**< Shift value for ECA_OFFSET                  */
#define _ECA_BUF_WMOFFSET_OFFSET_MASK                  0x7FFFCUL                               /**< Bit mask for ECA_OFFSET                     */
#define _ECA_BUF_WMOFFSET_OFFSET_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for ECA_BUF_WMOFFSET           */
#define ECA_BUF_WMOFFSET_OFFSET_DEFAULT                (_ECA_BUF_WMOFFSET_OFFSET_DEFAULT << 2) /**< Shifted mode DEFAULT for ECA_BUF_WMOFFSET   */

/* Bit fields for ECA BUFPTRSTATUS */
#define _ECA_BUFPTRSTATUS_RESETVALUE                   0x00000000UL                            /**< Default value for ECA_BUFPTRSTATUS          */
#define _ECA_BUFPTRSTATUS_MASK                         0xFFFFFFFFUL                            /**< Mask for ECA_BUFPTRSTATUS                   */
#define _ECA_BUFPTRSTATUS_STATUS_SHIFT                 0                                       /**< Shift value for ECA_STATUS                  */
#define _ECA_BUFPTRSTATUS_STATUS_MASK                  0xFFFFFFFFUL                            /**< Bit mask for ECA_STATUS                     */
#define _ECA_BUFPTRSTATUS_STATUS_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for ECA_BUFPTRSTATUS           */
#define ECA_BUFPTRSTATUS_STATUS_DEFAULT                (_ECA_BUFPTRSTATUS_STATUS_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_BUFPTRSTATUS   */

/* Bit fields for ECA STARTTRIGCTRL */
#define _ECA_STARTTRIGCTRL_RESETVALUE                  0x00000000UL                               /**< Default value for ECA_STARTTRIGCTRL         */
#define _ECA_STARTTRIGCTRL_MASK                        0x0000001FUL                               /**< Mask for ECA_STARTTRIGCTRL                  */
#define _ECA_STARTTRIGCTRL_TRACESEL_SHIFT              0                                          /**< Shift value for ECA_TRACESEL                */
#define _ECA_STARTTRIGCTRL_TRACESEL_MASK               0x7UL                                      /**< Bit mask for ECA_TRACESEL                   */
#define _ECA_STARTTRIGCTRL_TRACESEL_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for ECA_STARTTRIGCTRL          */
#define ECA_STARTTRIGCTRL_TRACESEL_DEFAULT             (_ECA_STARTTRIGCTRL_TRACESEL_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_STARTTRIGCTRL  */
#define ECA_STARTTRIGCTRL_ENABLE                       (0x1UL << 3)                               /**< Enable                                      */
#define _ECA_STARTTRIGCTRL_ENABLE_SHIFT                3                                          /**< Shift value for ECA_ENABLE                  */
#define _ECA_STARTTRIGCTRL_ENABLE_MASK                 0x8UL                                      /**< Bit mask for ECA_ENABLE                     */
#define _ECA_STARTTRIGCTRL_ENABLE_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for ECA_STARTTRIGCTRL          */
#define ECA_STARTTRIGCTRL_ENABLE_DEFAULT               (_ECA_STARTTRIGCTRL_ENABLE_DEFAULT << 3)   /**< Shifted mode DEFAULT for ECA_STARTTRIGCTRL  */
#define ECA_STARTTRIGCTRL_COMBMODE                     (0x1UL << 4)                               /**< Combination Mode                            */
#define _ECA_STARTTRIGCTRL_COMBMODE_SHIFT              4                                          /**< Shift value for ECA_COMBMODE                */
#define _ECA_STARTTRIGCTRL_COMBMODE_MASK               0x10UL                                     /**< Bit mask for ECA_COMBMODE                   */
#define _ECA_STARTTRIGCTRL_COMBMODE_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for ECA_STARTTRIGCTRL          */
#define _ECA_STARTTRIGCTRL_COMBMODE_AND                0x00000000UL                               /**< Mode AND for ECA_STARTTRIGCTRL              */
#define _ECA_STARTTRIGCTRL_COMBMODE_OR                 0x00000001UL                               /**< Mode OR for ECA_STARTTRIGCTRL               */
#define ECA_STARTTRIGCTRL_COMBMODE_DEFAULT             (_ECA_STARTTRIGCTRL_COMBMODE_DEFAULT << 4) /**< Shifted mode DEFAULT for ECA_STARTTRIGCTRL  */
#define ECA_STARTTRIGCTRL_COMBMODE_AND                 (_ECA_STARTTRIGCTRL_COMBMODE_AND << 4)     /**< Shifted mode AND for ECA_STARTTRIGCTRL      */
#define ECA_STARTTRIGCTRL_COMBMODE_OR                  (_ECA_STARTTRIGCTRL_COMBMODE_OR << 4)      /**< Shifted mode OR for ECA_STARTTRIGCTRL       */

/* Bit fields for ECA STOPTRIGCTRL */
#define _ECA_STOPTRIGCTRL_RESETVALUE                   0x00000000UL                              /**< Default value for ECA_STOPTRIGCTRL          */
#define _ECA_STOPTRIGCTRL_MASK                         0x0000001FUL                              /**< Mask for ECA_STOPTRIGCTRL                   */
#define _ECA_STOPTRIGCTRL_TRACESEL_SHIFT               0                                         /**< Shift value for ECA_TRACESEL                */
#define _ECA_STOPTRIGCTRL_TRACESEL_MASK                0x7UL                                     /**< Bit mask for ECA_TRACESEL                   */
#define _ECA_STOPTRIGCTRL_TRACESEL_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for ECA_STOPTRIGCTRL           */
#define ECA_STOPTRIGCTRL_TRACESEL_DEFAULT              (_ECA_STOPTRIGCTRL_TRACESEL_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_STOPTRIGCTRL   */
#define ECA_STOPTRIGCTRL_ENABLE                        (0x1UL << 3)                              /**< Enable                                      */
#define _ECA_STOPTRIGCTRL_ENABLE_SHIFT                 3                                         /**< Shift value for ECA_ENABLE                  */
#define _ECA_STOPTRIGCTRL_ENABLE_MASK                  0x8UL                                     /**< Bit mask for ECA_ENABLE                     */
#define _ECA_STOPTRIGCTRL_ENABLE_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for ECA_STOPTRIGCTRL           */
#define ECA_STOPTRIGCTRL_ENABLE_DEFAULT                (_ECA_STOPTRIGCTRL_ENABLE_DEFAULT << 3)   /**< Shifted mode DEFAULT for ECA_STOPTRIGCTRL   */
#define ECA_STOPTRIGCTRL_COMBMODE                      (0x1UL << 4)                              /**< Combination Mode                            */
#define _ECA_STOPTRIGCTRL_COMBMODE_SHIFT               4                                         /**< Shift value for ECA_COMBMODE                */
#define _ECA_STOPTRIGCTRL_COMBMODE_MASK                0x10UL                                    /**< Bit mask for ECA_COMBMODE                   */
#define _ECA_STOPTRIGCTRL_COMBMODE_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for ECA_STOPTRIGCTRL           */
#define _ECA_STOPTRIGCTRL_COMBMODE_AND                 0x00000000UL                              /**< Mode AND for ECA_STOPTRIGCTRL               */
#define _ECA_STOPTRIGCTRL_COMBMODE_OR                  0x00000001UL                              /**< Mode OR for ECA_STOPTRIGCTRL                */
#define ECA_STOPTRIGCTRL_COMBMODE_DEFAULT              (_ECA_STOPTRIGCTRL_COMBMODE_DEFAULT << 4) /**< Shifted mode DEFAULT for ECA_STOPTRIGCTRL   */
#define ECA_STOPTRIGCTRL_COMBMODE_AND                  (_ECA_STOPTRIGCTRL_COMBMODE_AND << 4)     /**< Shifted mode AND for ECA_STOPTRIGCTRL       */
#define ECA_STOPTRIGCTRL_COMBMODE_OR                   (_ECA_STOPTRIGCTRL_COMBMODE_OR << 4)      /**< Shifted mode OR for ECA_STOPTRIGCTRL        */

/* Bit fields for ECA STARTTRIGENMASK */
#define _ECA_STARTTRIGENMASK_RESETVALUE                0x00000000UL                               /**< Default value for ECA_STARTTRIGENMASK       */
#define _ECA_STARTTRIGENMASK_MASK                      0xFFFFFFFFUL                               /**< Mask for ECA_STARTTRIGENMASK                */
#define _ECA_STARTTRIGENMASK_ENMASK_SHIFT              0                                          /**< Shift value for ECA_ENMASK                  */
#define _ECA_STARTTRIGENMASK_ENMASK_MASK               0xFFFFFFFFUL                               /**< Bit mask for ECA_ENMASK                     */
#define _ECA_STARTTRIGENMASK_ENMASK_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for ECA_STARTTRIGENMASK        */
#define ECA_STARTTRIGENMASK_ENMASK_DEFAULT             (_ECA_STARTTRIGENMASK_ENMASK_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_STARTTRIGENMASK*/

/* Bit fields for ECA STARTTRIGREDMASK */
#define _ECA_STARTTRIGREDMASK_RESETVALUE               0x00000000UL                                 /**< Default value for ECA_STARTTRIGREDMASK      */
#define _ECA_STARTTRIGREDMASK_MASK                     0xFFFFFFFFUL                                 /**< Mask for ECA_STARTTRIGREDMASK               */
#define _ECA_STARTTRIGREDMASK_REDMASK_SHIFT            0                                            /**< Shift value for ECA_REDMASK                 */
#define _ECA_STARTTRIGREDMASK_REDMASK_MASK             0xFFFFFFFFUL                                 /**< Bit mask for ECA_REDMASK                    */
#define _ECA_STARTTRIGREDMASK_REDMASK_DEFAULT          0x00000000UL                                 /**< Mode DEFAULT for ECA_STARTTRIGREDMASK       */
#define ECA_STARTTRIGREDMASK_REDMASK_DEFAULT           (_ECA_STARTTRIGREDMASK_REDMASK_DEFAULT << 0) /**< Shifted mode DEFAULT for ECA_STARTTRIGREDMASK*/

